{
	"FormatVersion": 2,
	"Namespace": "",
	"Subnamespaces": [
		{
			"Namespace": "DroneOps",
			"Children": [
				{
					"Source": {
						"Text": "+ New security plan"
					},
					"Translation": {
						"Text": "+ New security plan"
					},
					"Key": "Workflow.NewPlan"
				},
				{
					"Source": {
						"Text": "2D SITUATION MAP"
					},
					"Translation": {
						"Text": "2D SITUATION MAP"
					},
					"Key": "Situation.Title"
				},
				{
					"Source": {
						"Text": "2D TACTICAL MAP | Z{0} | {1} UAV without GPS"
					},
					"Translation": {
						"Text": "2D TACTICAL MAP | Z{0} | {1} UAV without GPS"
					},
					"Key": "Tactical.Header"
				},
				{
					"Source": {
						"Text": "4 VIEW"
					},
					"Translation": {
						"Text": "4 VIEW"
					},
					"Key": "Video.Four"
				},
				{
					"Source": {
						"Text": "6 VIEW"
					},
					"Translation": {
						"Text": "6 VIEW"
					},
					"Key": "Video.Six"
				},
				{
					"Source": {
						"Text": "A group member failed; the entire mission group has failed and active members were asked to hold."
					},
					"Translation": {
						"Text": "A group member failed; the entire mission group has failed and active members were asked to hold."
					},
					"Key": "Errors.GROUP_MEMBER_FAILED"
				},
				{
					"Source": {
						"Text": "A simulated mission is active. Shutdown will persist it as paused and stop local simulation. Continue?"
					},
					"Translation": {
						"Text": "A simulated mission is active. Shutdown will persist it as paused and stop local simulation. Continue?"
					},
					"Key": "Execution.ShutdownConfirm"
				},
				{
					"Source": {
						"Text": "ACTIVE"
					},
					"Translation": {
						"Text": "ACTIVE"
					},
					"Key": "Tactical.Active"
				},
				{
					"Source": {
						"Text": "ADD TASK"
					},
					"Translation": {
						"Text": "ADD TASK"
					},
					"Key": "Plan.AddMission"
				},
				{
					"Source": {
						"Text": "ADD WAYPOINT"
					},
					"Translation": {
						"Text": "ADD WAYPOINT"
					},
					"Key": "Map.Add"
				},
				{
					"Source": {
						"Text": "AGL: above ground (unchecked: ellipsoid)"
					},
					"Translation": {
						"Text": "AGL: above ground (unchecked: ellipsoid)"
					},
					"Key": "Mission3D.AGL"
				},
				{
					"Source": {
						"Text": "AI DETECTION"
					},
					"Translation": {
						"Text": "AI DETECTION"
					},
					"Key": "Video.AI"
				},
				{
					"Source": {
						"Text": "AI DETECTION NOT CONNECTED"
					},
					"Translation": {
						"Text": "AI DETECTION NOT CONNECTED"
					},
					"Key": "Video.AINotConnected"
				},
				{
					"Source": {
						"Text": "AIRCRAFT"
					},
					"Translation": {
						"Text": "AIRCRAFT"
					},
					"Key": "Video.Aircraft"
				},
				{
					"Source": {
						"Text": "ALERT"
					},
					"Translation": {
						"Text": "ALERT"
					},
					"Key": "Status.ALERT"
				},
				{
					"Source": {
						"Text": "ALERT"
					},
					"Translation": {
						"Text": "ALERT"
					},
					"Key": "Tactical.Alert"
				},
				{
					"Source": {
						"Text": "ALERT FILTER"
					},
					"Translation": {
						"Text": "ALERT FILTER"
					},
					"Key": "Status.ALERT_FILTER"
				},
				{
					"Source": {
						"Text": "ALERTS · Last 200 / Session"
					},
					"Translation": {
						"Text": "ALERTS · Last 200 / Session"
					},
					"Key": "Command.Alerts"
				},
				{
					"Source": {
						"Text": "ALERT_RESPONSE"
					},
					"Translation": {
						"Text": "ALERT_RESPONSE"
					},
					"Key": "Status.ALERT_RESPONSE"
				},
				{
					"Source": {
						"Text": "ALL"
					},
					"Translation": {
						"Text": "ALL"
					},
					"Key": "Log.All"
				},
				{
					"Source": {
						"Text": "ALL"
					},
					"Translation": {
						"Text": "ALL"
					},
					"Key": "Status.ALL"
				},
				{
					"Source": {
						"Text": "ALT N/A | SPD N/A | BAT N/A"
					},
					"Translation": {
						"Text": "ALT N/A | SPD N/A | BAT N/A"
					},
					"Key": "Command.NoMetrics"
				},
				{
					"Source": {
						"Text": "ALT {0} | SPD {1} | BAT {2}"
					},
					"Translation": {
						"Text": "ALT {0} | SPD {1} | BAT {2}"
					},
					"Key": "Command.Metrics"
				},
				{
					"Source": {
						"Text": "APPLY WAYPOINT PARAMETERS"
					},
					"Translation": {
						"Text": "APPLY WAYPOINT PARAMETERS"
					},
					"Key": "Mission3D.Apply"
				},
				{
					"Source": {
						"Text": "ASSIGN UAV"
					},
					"Translation": {
						"Text": "ASSIGN UAV"
					},
					"Key": "Plan.Assign"
				},
				{
					"Source": {
						"Text": "Abort mission"
					},
					"Translation": {
						"Text": "Abort mission"
					},
					"Key": "Execution.Abort"
				},
				{
					"Source": {
						"Text": "Active UAV changed: {target}"
					},
					"Translation": {
						"Text": "Active UAV changed: {target}"
					},
					"Key": "Events.active_uav_changed"
				},
				{
					"Source": {
						"Text": "Adapter position is not a valid WGS84 coordinate."
					},
					"Translation": {
						"Text": "Adapter position is not a valid WGS84 coordinate."
					},
					"Key": "Errors.ADAPTER_POSITION_INVALID"
				},
				{
					"Source": {
						"Text": "Add at least one mission."
					},
					"Translation": {
						"Text": "Add at least one mission."
					},
					"Key": "Errors.NO_MISSIONS"
				},
				{
					"Source": {
						"Text": "Adjust the map view before editing."
					},
					"Translation": {
						"Text": "Adjust the map view before editing."
					},
					"Key": "Map.AdjustBeforeEdit"
				},
				{
					"Source": {
						"Text": "Alert selected: {target}"
					},
					"Translation": {
						"Text": "Alert selected: {target}"
					},
					"Key": "Events.alert_selected"
				},
				{
					"Source": {
						"Text": "Alerts"
					},
					"Translation": {
						"Text": "Alerts"
					},
					"Key": "Nav.Alerts"
				},
				{
					"Source": {
						"Text": "All waypoints completed"
					},
					"Translation": {
						"Text": "All waypoints completed"
					},
					"Key": "Execution.ROUTE_FINISHED"
				},
				{
					"Source": {
						"Text": "Altitude (m)"
					},
					"Translation": {
						"Text": "Altitude (m)"
					},
					"Key": "Mission3D.Altitude"
				},
				{
					"Source": {
						"Text": "Altitude reference"
					},
					"Translation": {
						"Text": "Altitude reference"
					},
					"Key": "Inspector.Reference"
				},
				{
					"Source": {
						"Text": "Another controller owns the aircraft."
					},
					"Translation": {
						"Text": "Another controller owns the aircraft."
					},
					"Key": "Errors.LEGACY_CONTROLLER_BUSY"
				},
				{
					"Source": {
						"Text": "Another editor owns this route session."
					},
					"Translation": {
						"Text": "Another editor owns this route session."
					},
					"Key": "Errors.EDIT_SESSION_CONFLICT"
				},
				{
					"Source": {
						"Text": "Area selected: {target}"
					},
					"Translation": {
						"Text": "Area selected: {target}"
					},
					"Key": "Events.active_area_id_changed"
				},
				{
					"Source": {
						"Text": "Arrange Windows"
					},
					"Translation": {
						"Text": "Arrange Windows"
					},
					"Key": "Launcher.Arrange"
				},
				{
					"Source": {
						"Text": "Assign a UAV to this mission."
					},
					"Translation": {
						"Text": "Assign a UAV to this mission."
					},
					"Key": "Errors.NO_UAV_ASSIGNED"
				},
				{
					"Source": {
						"Text": "Assigned UAV"
					},
					"Translation": {
						"Text": "Assigned UAV"
					},
					"Key": "Workflow.AssignedUAV"
				},
				{
					"Source": {
						"Text": "Available target area radius (m)"
					},
					"Translation": {
						"Text": "Available target area radius (m)"
					},
					"Key": "Group.Area"
				},
				{
					"Source": {
						"Text": "BACKEND OFFLINE / RECONNECTING"
					},
					"Translation": {
						"Text": "BACKEND OFFLINE / RECONNECTING"
					},
					"Key": "Stage1.System.OFFLINE"
				},
				{
					"Source": {
						"Text": "BACKEND {0} | SYNC {1} | ACTIVE {2} | v{3}"
					},
					"Translation": {
						"Text": "BACKEND {0} | SYNC {1} | ACTIVE {2} | v{3}"
					},
					"Key": "Common.Sync"
				},
				{
					"Source": {
						"Text": "BEGIN ROUTE EDIT"
					},
					"Translation": {
						"Text": "BEGIN ROUTE EDIT"
					},
					"Key": "Map.Begin"
				},
				{
					"Source": {
						"Text": "Back to security plans"
					},
					"Translation": {
						"Text": "Back to security plans"
					},
					"Key": "Workflow.BackPlans"
				},
				{
					"Source": {
						"Text": "Backend confirmed"
					},
					"Translation": {
						"Text": "Backend confirmed"
					},
					"Key": "Common.Confirmed"
				},
				{
					"Source": {
						"Text": "Backend connected"
					},
					"Translation": {
						"Text": "Backend connected"
					},
					"Key": "Events.backend_connected"
				},
				{
					"Source": {
						"Text": "Backend disconnected"
					},
					"Translation": {
						"Text": "Backend disconnected"
					},
					"Key": "Events.backend_disconnected"
				},
				{
					"Source": {
						"Text": "Backend offline. No change submitted."
					},
					"Translation": {
						"Text": "Backend offline. No change submitted."
					},
					"Key": "Errors.SYNC_OFFLINE"
				},
				{
					"Source": {
						"Text": "Backend reconnected"
					},
					"Translation": {
						"Text": "Backend reconnected"
					},
					"Key": "Events.backend_reconnected"
				},
				{
					"Source": {
						"Text": "Backend: {0}   ·   Map: {1}"
					},
					"Translation": {
						"Text": "Backend: {0}   ·   Map: {1}"
					},
					"Key": "Workflow.Readiness"
				},
				{
					"Source": {
						"Text": "Basic information"
					},
					"Translation": {
						"Text": "Basic information"
					},
					"Key": "Workflow.BasicInfo"
				},
				{
					"Source": {
						"Text": "Blocking issues"
					},
					"Translation": {
						"Text": "Blocking issues"
					},
					"Key": "Plan.Blocking"
				},
				{
					"Source": {
						"Text": "CANCEL"
					},
					"Translation": {
						"Text": "CANCEL"
					},
					"Key": "Common.Cancel"
				},
				{
					"Source": {
						"Text": "CANCEL SCHEDULE"
					},
					"Translation": {
						"Text": "CANCEL SCHEDULE"
					},
					"Key": "Schedule.Cancel"
				},
				{
					"Source": {
						"Text": "CANCELLED"
					},
					"Translation": {
						"Text": "CANCELLED"
					},
					"Key": "Execution.CANCELLED"
				},
				{
					"Source": {
						"Text": "CHECK CONFIGURATION"
					},
					"Translation": {
						"Text": "CHECK CONFIGURATION"
					},
					"Key": "Plan.Check"
				},
				{
					"Source": {
						"Text": "CLEAR DISPLAY"
					},
					"Translation": {
						"Text": "CLEAR DISPLAY"
					},
					"Key": "Log.Clear"
				},
				{
					"Source": {
						"Text": "CLEAR ROUTE"
					},
					"Translation": {
						"Text": "CLEAR ROUTE"
					},
					"Key": "Map.Clear"
				},
				{
					"Source": {
						"Text": "CLOSED"
					},
					"Translation": {
						"Text": "CLOSED"
					},
					"Key": "Status.CLOSED"
				},
				{
					"Source": {
						"Text": "COLLAPSE"
					},
					"Translation": {
						"Text": "COLLAPSE"
					},
					"Key": "Common.Collapse"
				},
				{
					"Source": {
						"Text": "COMMAND CENTER"
					},
					"Translation": {
						"Text": "COMMAND CENTER"
					},
					"Key": "Stage1.Command"
				},
				{
					"Source": {
						"Text": "COMMAND CENTER | {0} | {1} | Clients {2}/3"
					},
					"Translation": {
						"Text": "COMMAND CENTER | {0} | {1} | Clients {2}/3"
					},
					"Key": "Command.Header"
				},
				{
					"Source": {
						"Text": "CONFIGURATION VALID"
					},
					"Translation": {
						"Text": "CONFIGURATION VALID"
					},
					"Key": "Plan.READY"
				},
				{
					"Source": {
						"Text": "CONFIRM DEPLOY"
					},
					"Translation": {
						"Text": "CONFIRM DEPLOY"
					},
					"Key": "Plan.ConfirmDeploy"
				},
				{
					"Source": {
						"Text": "CONFIRM REVIEW"
					},
					"Translation": {
						"Text": "CONFIRM REVIEW"
					},
					"Key": "Plan.ConfirmReview"
				},
				{
					"Source": {
						"Text": "CONNECTED"
					},
					"Translation": {
						"Text": "CONNECTED"
					},
					"Key": "Common.Connected"
				},
				{
					"Source": {
						"Text": "CONNECTED TO EXISTING INSTANCE"
					},
					"Translation": {
						"Text": "CONNECTED TO EXISTING INSTANCE"
					},
					"Key": "Launcher.Existing"
				},
				{
					"Source": {
						"Text": "CONNECTING"
					},
					"Translation": {
						"Text": "CONNECTING"
					},
					"Key": "Status.CONNECTING"
				},
				{
					"Source": {
						"Text": "COPY AS DRAFT"
					},
					"Translation": {
						"Text": "COPY AS DRAFT"
					},
					"Key": "Plan.Copy"
				},
				{
					"Source": {
						"Text": "CRITICAL"
					},
					"Translation": {
						"Text": "CRITICAL"
					},
					"Key": "Alarm.Critical"
				},
				{
					"Source": {
						"Text": "CRITICAL"
					},
					"Translation": {
						"Text": "CRITICAL"
					},
					"Key": "Status.CRITICAL"
				},
				{
					"Source": {
						"Text": "Camera: N/A"
					},
					"Translation": {
						"Text": "Camera: N/A"
					},
					"Key": "Video.Camera"
				},
				{
					"Source": {
						"Text": "Cancel"
					},
					"Translation": {
						"Text": "Cancel"
					},
					"Key": "Execution.Cancel"
				},
				{
					"Source": {
						"Text": "Cannot move the plan while the mission is running."
					},
					"Translation": {
						"Text": "Cannot move the plan while the mission is running."
					},
					"Key": "Errors.PLAN_EXECUTING"
				},
				{
					"Source": {
						"Text": "Cannot resolve height. Select a waypoint, enter valid values and ensure terrain is loaded."
					},
					"Translation": {
						"Text": "Cannot resolve height. Select a waypoint, enter valid values and ensure terrain is loaded."
					},
					"Key": "Errors.ALTITUDE_DATUM_UNRESOLVED"
				},
				{
					"Source": {
						"Text": "Check"
					},
					"Translation": {
						"Text": "Check"
					},
					"Key": "Workflow.StepCheck"
				},
				{
					"Source": {
						"Text": "Check configuration and resolve blocking issues."
					},
					"Translation": {
						"Text": "Check configuration and resolve blocking issues."
					},
					"Key": "Errors.PLAN_NOT_READY"
				},
				{
					"Source": {
						"Text": "Check task assignment and saved route below."
					},
					"Translation": {
						"Text": "Check task assignment and saved route below."
					},
					"Key": "Workflow.CheckInformation"
				},
				{
					"Source": {
						"Text": "Checking simulation conditions"
					},
					"Translation": {
						"Text": "Checking simulation conditions"
					},
					"Key": "Execution.PREFLIGHT"
				},
				{
					"Source": {
						"Text": "Click a waypoint to select it. Click the map to add one. Enter or leave a field to update."
					},
					"Translation": {
						"Text": "Click a waypoint to select it. Click the map to add one. Enter or leave a field to update."
					},
					"Key": "Inspector.Help"
				},
				{
					"Source": {
						"Text": "Closed Route"
					},
					"Translation": {
						"Text": "Closed Route"
					},
					"Key": "Geometry.ClosedRoute"
				},
				{
					"Source": {
						"Text": "Closed route completed once"
					},
					"Translation": {
						"Text": "Closed route completed once"
					},
					"Key": "Events.ROUTE_CLOSURE_REACHED"
				},
				{
					"Source": {
						"Text": "Closed route requires at least 3 waypoints."
					},
					"Translation": {
						"Text": "Closed route requires at least 3 waypoints."
					},
					"Key": "Errors.CLOSED_ROUTE_TOO_SHORT"
				},
				{
					"Source": {
						"Text": "Closed route: {0} | Execution: once | Speed: {1} | Wait: {2}"
					},
					"Translation": {
						"Text": "Closed route: {0} | Execution: once | Speed: {1} | Wait: {2}"
					},
					"Key": "Plan.RouteParameters"
				},
				{
					"Source": {
						"Text": "Configuration check only. Terrain, airspace, endurance and flight safety are not assessed."
					},
					"Translation": {
						"Text": "Configuration check only. Terrain, airspace, endurance and flight safety are not assessed."
					},
					"Key": "Plan.Warnings"
				},
				{
					"Source": {
						"Text": "Configuration is deployed. The UAV has not started executing."
					},
					"Translation": {
						"Text": "Configuration is deployed. The UAV has not started executing."
					},
					"Key": "Workflow.DeploymentNotice"
				},
				{
					"Source": {
						"Text": "Configuration validation is stale."
					},
					"Translation": {
						"Text": "Configuration validation is stale."
					},
					"Key": "Errors.VALIDATION_STALE"
				},
				{
					"Source": {
						"Text": "Confirm"
					},
					"Translation": {
						"Text": "Confirm"
					},
					"Key": "Execution.Confirm"
				},
				{
					"Source": {
						"Text": "Confirm Abort"
					},
					"Translation": {
						"Text": "Confirm Abort"
					},
					"Key": "Execution.ConfirmAbort"
				},
				{
					"Source": {
						"Text": "Confirm Position"
					},
					"Translation": {
						"Text": "Confirm Position"
					},
					"Key": "Geometry.Confirm"
				},
				{
					"Source": {
						"Text": "Confirm Return"
					},
					"Translation": {
						"Text": "Confirm Return"
					},
					"Key": "Execution.ConfirmReturn"
				},
				{
					"Source": {
						"Text": "Confirm Return Home? Remaining waypoints will be skipped and the real UAV will be commanded to its calibrated Home."
					},
					"Translation": {
						"Text": "Confirm Return Home? Remaining waypoints will be skipped and the real UAV will be commanded to its calibrated Home."
					},
					"Key": "Execution.Real.returnConfirm"
				},
				{
					"Source": {
						"Text": "Confirm Return Home? Remaining waypoints will be skipped. The Mock UAV will return to its defined Home."
					},
					"Translation": {
						"Text": "Confirm Return Home? Remaining waypoints will be skipped. The Mock UAV will return to its defined Home."
					},
					"Key": "Execution.returnConfirm"
				},
				{
					"Source": {
						"Text": "Confirm Start Mission"
					},
					"Translation": {
						"Text": "Confirm Start Mission"
					},
					"Key": "Execution.ConfirmStart"
				},
				{
					"Source": {
						"Text": "Confirm abort? The mission cannot resume. Backend requests a hold at the measured position and reports any rejection."
					},
					"Translation": {
						"Text": "Confirm abort? The mission cannot resume. Backend requests a hold at the measured position and reports any rejection."
					},
					"Key": "Execution.Real.abortConfirm"
				},
				{
					"Source": {
						"Text": "Confirm abort? This execution cannot be resumed. The Mock UAV will stop at its current position."
					},
					"Translation": {
						"Text": "Confirm abort? This execution cannot be resumed. The Mock UAV will stop at its current position."
					},
					"Key": "Execution.abortConfirm"
				},
				{
					"Source": {
						"Text": "Confirm and deploy →"
					},
					"Translation": {
						"Text": "Confirm and deploy →"
					},
					"Key": "Workflow.ConfirmDeploy"
				},
				{
					"Source": {
						"Text": "Confirm delete draft"
					},
					"Translation": {
						"Text": "Confirm delete draft"
					},
					"Key": "Workflow.DeleteDraft"
				},
				{
					"Source": {
						"Text": "Confirm mission execution"
					},
					"Translation": {
						"Text": "Confirm mission execution"
					},
					"Key": "Execution.StartConfirm"
				},
				{
					"Source": {
						"Text": "Continue editing"
					},
					"Translation": {
						"Text": "Continue editing"
					},
					"Key": "Workflow.ContinueEditing"
				},
				{
					"Source": {
						"Text": "Create a new version from this plan"
					},
					"Translation": {
						"Text": "Create a new version from this plan"
					},
					"Key": "Workflow.NewVersion"
				},
				{
					"Source": {
						"Text": "Create and continue"
					},
					"Translation": {
						"Text": "Create and continue"
					},
					"Key": "Workflow.CreateContinue"
				},
				{
					"Source": {
						"Text": "Create → Configure → Edit route → Check → Deploy"
					},
					"Translation": {
						"Text": "Create → Configure → Edit route → Check → Deploy"
					},
					"Key": "Workflow.GlobalHint"
				},
				{
					"Source": {
						"Text": "Created a new version: {plan_name}"
					},
					"Translation": {
						"Text": "Created a new version: {plan_name}"
					},
					"Key": "Events.PLAN_VERSION_CREATED"
				},
				{
					"Source": {
						"Text": "Created: {0}"
					},
					"Translation": {
						"Text": "Created: {0}"
					},
					"Key": "Workflow.CreatedAt"
				},
				{
					"Source": {
						"Text": "Current security plan\n{0}\n{1}"
					},
					"Translation": {
						"Text": "Current security plan\n{0}\n{1}"
					},
					"Key": "Workflow.CurrentPlan"
				},
				{
					"Source": {
						"Text": "DELETE MISSION"
					},
					"Translation": {
						"Text": "DELETE MISSION"
					},
					"Key": "Plan.Delete"
				},
				{
					"Source": {
						"Text": "DELETE WAYPOINT"
					},
					"Translation": {
						"Text": "DELETE WAYPOINT"
					},
					"Key": "Map.Delete"
				},
				{
					"Source": {
						"Text": "DEPLOY PLAN"
					},
					"Translation": {
						"Text": "DEPLOY PLAN"
					},
					"Key": "Plan.Deploy"
				},
				{
					"Source": {
						"Text": "DIRTY / UNSAVED"
					},
					"Translation": {
						"Text": "DIRTY / UNSAVED"
					},
					"Key": "Map.DIRTY"
				},
				{
					"Source": {
						"Text": "DISCARD CHANGES"
					},
					"Translation": {
						"Text": "DISCARD CHANGES"
					},
					"Key": "Common.Discard"
				},
				{
					"Source": {
						"Text": "DISCONNECTED"
					},
					"Translation": {
						"Text": "DISCONNECTED"
					},
					"Key": "Common.Disconnected"
				},
				{
					"Source": {
						"Text": "DRAFT"
					},
					"Translation": {
						"Text": "DRAFT"
					},
					"Key": "Plan.DRAFT"
				},
				{
					"Source": {
						"Text": "DRONE SECURITY COMMAND SYSTEM"
					},
					"Translation": {
						"Text": "DRONE SECURITY COMMAND SYSTEM"
					},
					"Key": "Stage1.Name"
				},
				{
					"Source": {
						"Text": "Declare the real anchor altitude datum before execution."
					},
					"Translation": {
						"Text": "Declare the real anchor altitude datum before execution."
					},
					"Key": "Errors.REAL_ANCHOR_DATUM_UNRESOLVED"
				},
				{
					"Source": {
						"Text": "Deploy"
					},
					"Translation": {
						"Text": "Deploy"
					},
					"Key": "Workflow.StepDeploy"
				},
				{
					"Source": {
						"Text": "Deploy Plan →"
					},
					"Translation": {
						"Text": "Deploy Plan →"
					},
					"Key": "Execution.Deploy"
				},
				{
					"Source": {
						"Text": "Deployed"
					},
					"Translation": {
						"Text": "Deployed"
					},
					"Key": "Plan.DEPLOYED"
				},
				{
					"Source": {
						"Text": "Deployed"
					},
					"Translation": {
						"Text": "Deployed"
					},
					"Key": "Workflow.Deployed"
				},
				{
					"Source": {
						"Text": "Deployed plan is read only."
					},
					"Translation": {
						"Text": "Deployed plan is read only."
					},
					"Key": "Errors.PLAN_DEPLOYED"
				},
				{
					"Source": {
						"Text": "Deployed route is read-only"
					},
					"Translation": {
						"Text": "Deployed route is read-only"
					},
					"Key": "Execution.ReadOnly"
				},
				{
					"Source": {
						"Text": "Deployment created: {plan_name}"
					},
					"Translation": {
						"Text": "Deployment created: {plan_name}"
					},
					"Key": "Events.DEPLOYMENT_CREATED"
				},
				{
					"Source": {
						"Text": "Deployment record"
					},
					"Translation": {
						"Text": "Deployment record"
					},
					"Key": "Plan.Deployment"
				},
				{
					"Source": {
						"Text": "Deployment snapshot is missing."
					},
					"Translation": {
						"Text": "Deployment snapshot is missing."
					},
					"Key": "Errors.DEPLOYMENT_MISSING"
				},
				{
					"Source": {
						"Text": "Description"
					},
					"Translation": {
						"Text": "Description"
					},
					"Key": "Plan.Description"
				},
				{
					"Source": {
						"Text": "Discard local changes and reload the saved route?"
					},
					"Translation": {
						"Text": "Discard local changes and reload the saved route?"
					},
					"Key": "Map.DiscardPrompt"
				},
				{
					"Source": {
						"Text": "Disconnected"
					},
					"Translation": {
						"Text": "Disconnected"
					},
					"Key": "Fleet.Lost"
				},
				{
					"Source": {
						"Text": "Distance: {0} m · Estimated: {1} min (minimum estimate speed 1 m/s)"
					},
					"Translation": {
						"Text": "Distance: {0} m · Estimated: {1} min (minimum estimate speed 1 m/s)"
					},
					"Key": "Workflow.RouteStats"
				},
				{
					"Source": {
						"Text": "Draft deleted: {plan_name}"
					},
					"Translation": {
						"Text": "Draft deleted: {plan_name}"
					},
					"Key": "Events.PLAN_DELETED"
				},
				{
					"Source": {
						"Text": "Drag the center handle to move all routes."
					},
					"Translation": {
						"Text": "Drag the center handle to move all routes."
					},
					"Key": "Geometry.Drag"
				},
				{
					"Source": {
						"Text": "Duplicate"
					},
					"Translation": {
						"Text": "Duplicate"
					},
					"Key": "Workflow.Duplicate"
				},
				{
					"Source": {
						"Text": "EDIT ROUTE ON MAP"
					},
					"Translation": {
						"Text": "EDIT ROUTE ON MAP"
					},
					"Key": "Plan.EditMap"
				},
				{
					"Source": {
						"Text": "EDITING"
					},
					"Translation": {
						"Text": "EDITING"
					},
					"Key": "Map.EDITING"
				},
				{
					"Source": {
						"Text": "EVENT / OPERATION LOG (UTC) | Critical {0} | Warning {1}"
					},
					"Translation": {
						"Text": "EVENT / OPERATION LOG (UTC) | Critical {0} | Warning {1}"
					},
					"Key": "Log.Count"
				},
				{
					"Source": {
						"Text": "EXIT"
					},
					"Translation": {
						"Text": "EXIT"
					},
					"Key": "Common.Exit"
				},
				{
					"Source": {
						"Text": "EXPAND"
					},
					"Translation": {
						"Text": "EXPAND"
					},
					"Key": "Common.Expand"
				},
				{
					"Source": {
						"Text": "Edit Route in Map →"
					},
					"Translation": {
						"Text": "Edit Route in Map →"
					},
					"Key": "Workflow.EditMap"
				},
				{
					"Source": {
						"Text": "Edit and save a route on Map."
					},
					"Translation": {
						"Text": "Edit and save a route on Map."
					},
					"Key": "Errors.ROUTE_MISSING"
				},
				{
					"Source": {
						"Text": "Edit speed"
					},
					"Translation": {
						"Text": "Edit speed"
					},
					"Key": "Workflow.EditSpeed"
				},
				{
					"Source": {
						"Text": "Editing in Map\n{0}\n{1} · {2}\nSaved waypoints: {3}"
					},
					"Translation": {
						"Text": "Editing in Map\n{0}\n{1} · {2}\nSaved waypoints: {3}"
					},
					"Key": "Workflow.MapEditingStatus"
				},
				{
					"Source": {
						"Text": "Editing lease expired. Local draft retained; discard and reload."
					},
					"Translation": {
						"Text": "Editing lease expired. Local draft retained; discard and reload."
					},
					"Key": "Errors.EDIT_SESSION_EXPIRED"
				},
				{
					"Source": {
						"Text": "Ellipsoid"
					},
					"Translation": {
						"Text": "Ellipsoid"
					},
					"Key": "RouteVisual.Ellipsoid"
				},
				{
					"Source": {
						"Text": "English"
					},
					"Translation": {
						"Text": "English"
					},
					"Key": "Workflow.English"
				},
				{
					"Source": {
						"Text": "Enter a valid future local date and time."
					},
					"Translation": {
						"Text": "Enter a valid future local date and time."
					},
					"Key": "Errors.INVALID_SCHEDULE"
				},
				{
					"Source": {
						"Text": "Enter a valid name."
					},
					"Translation": {
						"Text": "Enter a valid name."
					},
					"Key": "Errors.INVALID_NAME"
				},
				{
					"Source": {
						"Text": "Enter finite values: hover >= 0; speed 0 to 15 m/s."
					},
					"Translation": {
						"Text": "Enter finite values: hover >= 0; speed 0 to 15 m/s."
					},
					"Key": "Errors.WAYPOINT_PARAMETERS_INVALID"
				},
				{
					"Source": {
						"Text": "Entered alert response"
					},
					"Translation": {
						"Text": "Entered alert response"
					},
					"Key": "Events.enter_alert_response"
				},
				{
					"Source": {
						"Text": "Estimated distance: {0} m · Time: {1} seconds"
					},
					"Translation": {
						"Text": "Estimated distance: {0} m · Time: {1} seconds"
					},
					"Key": "Execution.Estimate"
				},
				{
					"Source": {
						"Text": "Execution Monitor"
					},
					"Translation": {
						"Text": "Execution Monitor"
					},
					"Key": "Execution.MonitorNeutral"
				},
				{
					"Source": {
						"Text": "Execution Monitor · SIMULATION"
					},
					"Translation": {
						"Text": "Execution Monitor · SIMULATION"
					},
					"Key": "Execution.Monitor"
				},
				{
					"Source": {
						"Text": "Execution history / View plan"
					},
					"Translation": {
						"Text": "Execution history / View plan"
					},
					"Key": "Execution.History"
				},
				{
					"Source": {
						"Text": "Execution no longer exists."
					},
					"Translation": {
						"Text": "Execution no longer exists."
					},
					"Key": "Errors.EXECUTION_NOT_FOUND"
				},
				{
					"Source": {
						"Text": "Execution request identifier is required."
					},
					"Translation": {
						"Text": "Execution request identifier is required."
					},
					"Key": "Errors.REQUEST_ID_REQUIRED"
				},
				{
					"Source": {
						"Text": "Execution time: {0} seconds"
					},
					"Translation": {
						"Text": "Execution time: {0} seconds"
					},
					"Key": "Execution.Duration"
				},
				{
					"Source": {
						"Text": "FAILED"
					},
					"Translation": {
						"Text": "FAILED"
					},
					"Key": "Launcher.FAILED"
				},
				{
					"Source": {
						"Text": "FOCUS"
					},
					"Translation": {
						"Text": "FOCUS"
					},
					"Key": "Video.Focus"
				},
				{
					"Source": {
						"Text": "FOCUS ROUTE"
					},
					"Translation": {
						"Text": "FOCUS ROUTE"
					},
					"Key": "Map.Focus"
				},
				{
					"Source": {
						"Text": "Finish route editing"
					},
					"Translation": {
						"Text": "Finish route editing"
					},
					"Key": "Workflow.FinishRoute"
				},
				{
					"Source": {
						"Text": "Finish route editing before switching map mode."
					},
					"Translation": {
						"Text": "Finish route editing before switching map mode."
					},
					"Key": "Map.FinishBeforeMode"
				},
				{
					"Source": {
						"Text": "Focus"
					},
					"Translation": {
						"Text": "Focus"
					},
					"Key": "Launcher.Focus"
				},
				{
					"Source": {
						"Text": "Formation requires a nonpolar area within 10 km."
					},
					"Translation": {
						"Text": "Formation requires a nonpolar area within 10 km."
					},
					"Key": "Errors.TRAJECTORY_DOMAIN_UNSUPPORTED"
				},
				{
					"Source": {
						"Text": "Fresh valid aircraft telemetry is unavailable."
					},
					"Translation": {
						"Text": "Fresh valid aircraft telemetry is unavailable."
					},
					"Key": "Errors.REAL_TELEMETRY_UNAVAILABLE"
				},
				{
					"Source": {
						"Text": "GROUP CONTROL"
					},
					"Translation": {
						"Text": "GROUP CONTROL"
					},
					"Key": "Group.Title"
				},
				{
					"Source": {
						"Text": "Group anchor ellipsoid altitude (m)"
					},
					"Translation": {
						"Text": "Group anchor ellipsoid altitude (m)"
					},
					"Key": "Group.Altitude"
				},
				{
					"Source": {
						"Text": "Group anchor latitude (WGS84)"
					},
					"Translation": {
						"Text": "Group anchor latitude (WGS84)"
					},
					"Key": "Group.Latitude"
				},
				{
					"Source": {
						"Text": "Group anchor longitude (WGS84)"
					},
					"Translation": {
						"Text": "Group anchor longitude (WGS84)"
					},
					"Key": "Group.Longitude"
				},
				{
					"Source": {
						"Text": "Group command accepted by Backend"
					},
					"Translation": {
						"Text": "Group command accepted by Backend"
					},
					"Key": "Group.Accepted"
				},
				{
					"Source": {
						"Text": "Handled"
					},
					"Translation": {
						"Text": "Handled"
					},
					"Key": "Alarm.Handled"
				},
				{
					"Source": {
						"Text": "Hold was not confirmed. Check the aircraft and control link immediately."
					},
					"Translation": {
						"Text": "Hold was not confirmed. Check the aircraft and control link immediately."
					},
					"Key": "Errors.REAL_HOLD_REJECTED"
				},
				{
					"Source": {
						"Text": "Hover time (seconds)"
					},
					"Translation": {
						"Text": "Hover time (seconds)"
					},
					"Key": "Mission3D.Hover"
				},
				{
					"Source": {
						"Text": "INFO"
					},
					"Translation": {
						"Text": "INFO"
					},
					"Key": "Alarm.Info"
				},
				{
					"Source": {
						"Text": "INFO"
					},
					"Translation": {
						"Text": "INFO"
					},
					"Key": "Status.INFO"
				},
				{
					"Source": {
						"Text": "Idle"
					},
					"Translation": {
						"Text": "Idle"
					},
					"Key": "Fleet.Idle"
				},
				{
					"Source": {
						"Text": "Immutable deployment and saved route"
					},
					"Translation": {
						"Text": "Immutable deployment and saved route"
					},
					"Key": "Execution.DeploymentValid"
				},
				{
					"Source": {
						"Text": "Info"
					},
					"Translation": {
						"Text": "Info"
					},
					"Key": "Workflow.StepInfo"
				},
				{
					"Source": {
						"Text": "LINK N/A | MISSION N/A"
					},
					"Translation": {
						"Text": "LINK N/A | MISSION N/A"
					},
					"Key": "Command.NoMission"
				},
				{
					"Source": {
						"Text": "LINK {0}\nMISSION {1}"
					},
					"Translation": {
						"Text": "LINK {0}\nMISSION {1}"
					},
					"Key": "Command.Link"
				},
				{
					"Source": {
						"Text": "LIVE CONTROL · Real UAV"
					},
					"Translation": {
						"Text": "LIVE CONTROL · Real UAV"
					},
					"Key": "Execution.Real"
				},
				{
					"Source": {
						"Text": "LOCATE"
					},
					"Translation": {
						"Text": "LOCATE"
					},
					"Key": "Map.Locate"
				},
				{
					"Source": {
						"Text": "LOST"
					},
					"Translation": {
						"Text": "LOST"
					},
					"Key": "Common.Lost"
				},
				{
					"Source": {
						"Text": "Language"
					},
					"Translation": {
						"Text": "Language"
					},
					"Key": "Common.Language"
				},
				{
					"Source": {
						"Text": "Language {0}  |  {1}"
					},
					"Translation": {
						"Text": "Language {0}  |  {1}"
					},
					"Key": "Stage1.Detail"
				},
				{
					"Source": {
						"Text": "Last saved: {0}"
					},
					"Translation": {
						"Text": "Last saved: {0}"
					},
					"Key": "Workflow.LastSaved"
				},
				{
					"Source": {
						"Text": "Launch System"
					},
					"Translation": {
						"Text": "Launch System"
					},
					"Key": "Launcher.Start"
				},
				{
					"Source": {
						"Text": "Line formation spacing (m)"
					},
					"Translation": {
						"Text": "Line formation spacing (m)"
					},
					"Key": "Formation.LineSpacing"
				},
				{
					"Source": {
						"Text": "Local rehearsal: backend refresh disabled"
					},
					"Translation": {
						"Text": "Local rehearsal: backend refresh disabled"
					},
					"Key": "Fleet.Local"
				},
				{
					"Source": {
						"Text": "Local start date/time: YYYY-MM-DDTHH:MM:SS"
					},
					"Translation": {
						"Text": "Local start date/time: YYYY-MM-DDTHH:MM:SS"
					},
					"Key": "Schedule.LocalTime"
				},
				{
					"Source": {
						"Text": "Logs"
					},
					"Translation": {
						"Text": "Logs"
					},
					"Key": "Nav.Logs"
				},
				{
					"Source": {
						"Text": "Longitude: {0}\nLatitude: {1}"
					},
					"Translation": {
						"Text": "Longitude: {0}\nLatitude: {1}"
					},
					"Key": "Inspector.Coordinates"
				},
				{
					"Source": {
						"Text": "MAP OPERATIONS"
					},
					"Translation": {
						"Text": "MAP OPERATIONS"
					},
					"Key": "Map.Header"
				},
				{
					"Source": {
						"Text": "MARK HANDLED"
					},
					"Translation": {
						"Text": "MARK HANDLED"
					},
					"Key": "Command.Handled"
				},
				{
					"Source": {
						"Text": "MEDIA ERROR"
					},
					"Translation": {
						"Text": "MEDIA ERROR"
					},
					"Key": "Status.MEDIA_ERROR"
				},
				{
					"Source": {
						"Text": "MISSION"
					},
					"Translation": {
						"Text": "MISSION"
					},
					"Key": "Status.MISSION"
				},
				{
					"Source": {
						"Text": "MISSION ROUTE"
					},
					"Translation": {
						"Text": "MISSION ROUTE"
					},
					"Key": "Map.Route"
				},
				{
					"Source": {
						"Text": "MISSIONS"
					},
					"Translation": {
						"Text": "MISSIONS"
					},
					"Key": "Plan.Missions"
				},
				{
					"Source": {
						"Text": "MISSION_EXECUTION"
					},
					"Translation": {
						"Text": "MISSION_EXECUTION"
					},
					"Key": "Status.MISSION_EXECUTION"
				},
				{
					"Source": {
						"Text": "MONITOR"
					},
					"Translation": {
						"Text": "MONITOR"
					},
					"Key": "Status.MONITOR"
				},
				{
					"Source": {
						"Text": "MOVE GROUP"
					},
					"Translation": {
						"Text": "MOVE GROUP"
					},
					"Key": "Group.Move"
				},
				{
					"Source": {
						"Text": "MULTI SELECTED"
					},
					"Translation": {
						"Text": "MULTI SELECTED"
					},
					"Key": "Fleet.Multi"
				},
				{
					"Source": {
						"Text": "Map client offline\nYour saved draft is retained.\n{0}\n{1} · {2}\nSaved waypoints: {3}"
					},
					"Translation": {
						"Text": "Map client offline\nYour saved draft is retained.\n{0}\n{1} · {2}\nSaved waypoints: {3}"
					},
					"Key": "Workflow.MapOfflineStatus"
				},
				{
					"Source": {
						"Text": "Map client unavailable"
					},
					"Translation": {
						"Text": "Map client unavailable"
					},
					"Key": "Errors.MAP_CLIENT_UNAVAILABLE"
				},
				{
					"Source": {
						"Text": "Map coordinates are not ready. Retry when the map is loaded."
					},
					"Translation": {
						"Text": "Map coordinates are not ready. Retry when the map is loaded."
					},
					"Key": "Errors.COORDINATES_NOT_READY"
				},
				{
					"Source": {
						"Text": "Map initializing"
					},
					"Translation": {
						"Text": "Map initializing"
					},
					"Key": "Map.Init"
				},
				{
					"Source": {
						"Text": "Map route editing is in progress. Save or discard before review or deployment."
					},
					"Translation": {
						"Text": "Map route editing is in progress. Save or discard before review or deployment."
					},
					"Key": "Errors.PLAN_EDIT_IN_PROGRESS"
				},
				{
					"Source": {
						"Text": "Measured NED position is invalid."
					},
					"Translation": {
						"Text": "Measured NED position is invalid."
					},
					"Key": "Errors.REAL_NED_INVALID"
				},
				{
					"Source": {
						"Text": "Measured UAV position left the hover tolerance."
					},
					"Translation": {
						"Text": "Measured UAV position left the hover tolerance."
					},
					"Key": "Errors.REAL_HOVER_DRIFT"
				},
				{
					"Source": {
						"Text": "Mission aborted"
					},
					"Translation": {
						"Text": "Mission aborted"
					},
					"Key": "Execution.ABORTED"
				},
				{
					"Source": {
						"Text": "Mission aborted · {uav_id}"
					},
					"Translation": {
						"Text": "Mission aborted · {uav_id}"
					},
					"Key": "Events.MISSION_ABORTED"
				},
				{
					"Source": {
						"Text": "Mission completed"
					},
					"Translation": {
						"Text": "Mission completed"
					},
					"Key": "Execution.COMPLETED"
				},
				{
					"Source": {
						"Text": "Mission completed · {uav_id}"
					},
					"Translation": {
						"Text": "Mission completed · {uav_id}"
					},
					"Key": "Events.MISSION_COMPLETED"
				},
				{
					"Source": {
						"Text": "Mission created"
					},
					"Translation": {
						"Text": "Mission created"
					},
					"Key": "Execution.CREATED"
				},
				{
					"Source": {
						"Text": "Mission executing"
					},
					"Translation": {
						"Text": "Mission executing"
					},
					"Key": "Execution.EXECUTING"
				},
				{
					"Source": {
						"Text": "Mission execution created · {uav_id}"
					},
					"Translation": {
						"Text": "Mission execution created · {uav_id}"
					},
					"Key": "Events.EXECUTION_CREATED"
				},
				{
					"Source": {
						"Text": "Mission failed"
					},
					"Translation": {
						"Text": "Mission failed"
					},
					"Key": "Execution.FAILED"
				},
				{
					"Source": {
						"Text": "Mission failed · {uav_id}"
					},
					"Translation": {
						"Text": "Mission failed · {uav_id}"
					},
					"Key": "Events.MISSION_FAILED"
				},
				{
					"Source": {
						"Text": "Mission paused"
					},
					"Translation": {
						"Text": "Mission paused"
					},
					"Key": "Execution.PAUSED"
				},
				{
					"Source": {
						"Text": "Mission paused · {uav_id}"
					},
					"Translation": {
						"Text": "Mission paused · {uav_id}"
					},
					"Key": "Events.MISSION_PAUSED"
				},
				{
					"Source": {
						"Text": "Mission resumed · {uav_id}"
					},
					"Translation": {
						"Text": "Mission resumed · {uav_id}"
					},
					"Key": "Events.MISSION_RESUMED"
				},
				{
					"Source": {
						"Text": "Mission selected: {target}"
					},
					"Translation": {
						"Text": "Mission selected: {target}"
					},
					"Key": "Events.active_mission_id_changed"
				},
				{
					"Source": {
						"Text": "Mission started · {uav_id}"
					},
					"Translation": {
						"Text": "Mission started · {uav_id}"
					},
					"Key": "Events.MISSION_STARTED"
				},
				{
					"Source": {
						"Text": "Mission starting · {uav_id}"
					},
					"Translation": {
						"Text": "Mission starting · {uav_id}"
					},
					"Key": "Events.MISSION_STARTING"
				},
				{
					"Source": {
						"Text": "Mission state changed. Review the current state and retry."
					},
					"Translation": {
						"Text": "Mission state changed. Review the current state and retry."
					},
					"Key": "Errors.EXECUTION_STALE"
				},
				{
					"Source": {
						"Text": "Mission {mission_name} UAV unassigned"
					},
					"Translation": {
						"Text": "Mission {mission_name} UAV unassigned"
					},
					"Key": "Events.UAV_UNASSIGNED"
				},
				{
					"Source": {
						"Text": "Mission {mission_name} created"
					},
					"Translation": {
						"Text": "Mission {mission_name} created"
					},
					"Key": "Events.MISSION_CREATED"
				},
				{
					"Source": {
						"Text": "Mission {mission_name} renamed"
					},
					"Translation": {
						"Text": "Mission {mission_name} renamed"
					},
					"Key": "Events.MISSION_UPDATED"
				},
				{
					"Source": {
						"Text": "Mission {mission_name} route cleared"
					},
					"Translation": {
						"Text": "Mission {mission_name} route cleared"
					},
					"Key": "Events.ROUTE_CLEARED"
				},
				{
					"Source": {
						"Text": "Mission {mission_name} route saved"
					},
					"Translation": {
						"Text": "Mission {mission_name} route saved"
					},
					"Key": "Events.ROUTE_CREATED"
				},
				{
					"Source": {
						"Text": "Mission {mission_name} route updated"
					},
					"Translation": {
						"Text": "Mission {mission_name} route updated"
					},
					"Key": "Events.ROUTE_UPDATED"
				},
				{
					"Source": {
						"Text": "Mission {target_id} deleted"
					},
					"Translation": {
						"Text": "Mission {target_id} deleted"
					},
					"Key": "Events.MISSION_DELETED"
				},
				{
					"Source": {
						"Text": "Mock UAV unavailable. Check the simulation fixture and registry."
					},
					"Translation": {
						"Text": "Mock UAV unavailable. Check the simulation fixture and registry."
					},
					"Key": "Errors.MOCK_UAV_UNAVAILABLE"
				},
				{
					"Source": {
						"Text": "Model not supplied by Registry. Visual presets are not aircraft specifications."
					},
					"Translation": {
						"Text": "Model not supplied by Registry. Visual presets are not aircraft specifications."
					},
					"Key": "Video.ModelNotice"
				},
				{
					"Source": {
						"Text": "Move Plan"
					},
					"Translation": {
						"Text": "Move Plan"
					},
					"Key": "Geometry.MovePlan"
				},
				{
					"Source": {
						"Text": "Moving Security Plan: {0}"
					},
					"Translation": {
						"Text": "Moving Security Plan: {0}"
					},
					"Key": "Geometry.Moving"
				},
				{
					"Source": {
						"Text": "NEW PLAN"
					},
					"Translation": {
						"Text": "NEW PLAN"
					},
					"Key": "Plan.New"
				},
				{
					"Source": {
						"Text": "NO ACTIVE ALERTS"
					},
					"Translation": {
						"Text": "NO ACTIVE ALERTS"
					},
					"Key": "Video.NoAlerts"
				},
				{
					"Source": {
						"Text": "NO SOURCE"
					},
					"Translation": {
						"Text": "NO SOURCE"
					},
					"Key": "Status.NO_SOURCE"
				},
				{
					"Source": {
						"Text": "NO SOURCE\nAssign a video source to this UAV"
					},
					"Translation": {
						"Text": "NO SOURCE\nAssign a video source to this UAV"
					},
					"Key": "Video.NoSource"
				},
				{
					"Source": {
						"Text": "NO TARGET"
					},
					"Translation": {
						"Text": "NO TARGET"
					},
					"Key": "Status.NO_TARGET"
				},
				{
					"Source": {
						"Text": "NO TARGET\nNO ACTIVE STREAM"
					},
					"Translation": {
						"Text": "NO TARGET\nNO ACTIVE STREAM"
					},
					"Key": "Video.NoTarget"
				},
				{
					"Source": {
						"Text": "NO VIDEO TARGET\nChoose View Video to open a UAV feed."
					},
					"Translation": {
						"Text": "NO VIDEO TARGET\nChoose View Video to open a UAV feed."
					},
					"Key": "Video.NoTargetHint"
				},
				{
					"Source": {
						"Text": "Next: task configuration"
					},
					"Translation": {
						"Text": "Next: task configuration"
					},
					"Key": "Workflow.NextTask"
				},
				{
					"Source": {
						"Text": "No UAV selected"
					},
					"Translation": {
						"Text": "No UAV selected"
					},
					"Key": "Command.NoSelection"
				},
				{
					"Source": {
						"Text": "No active execution conflict"
					},
					"Translation": {
						"Text": "No active execution conflict"
					},
					"Key": "Execution.NoConflict"
				},
				{
					"Source": {
						"Text": "No active mission"
					},
					"Translation": {
						"Text": "No active mission"
					},
					"Key": "Execution.None"
				},
				{
					"Source": {
						"Text": "No active plan"
					},
					"Translation": {
						"Text": "No active plan"
					},
					"Key": "Plan.NoPlan"
				},
				{
					"Source": {
						"Text": "No alerts in this session"
					},
					"Translation": {
						"Text": "No alerts in this session"
					},
					"Key": "Command.NoAlerts"
				},
				{
					"Source": {
						"Text": "No events in this view"
					},
					"Translation": {
						"Text": "No events in this view"
					},
					"Key": "Log.Empty"
				},
				{
					"Source": {
						"Text": "No missions / Add first mission"
					},
					"Translation": {
						"Text": "No missions / Add first mission"
					},
					"Key": "Plan.NoMissions"
				},
				{
					"Source": {
						"Text": "No valid map position"
					},
					"Translation": {
						"Text": "No valid map position"
					},
					"Key": "Map.InvalidPosition"
				},
				{
					"Source": {
						"Text": "Not assigned"
					},
					"Translation": {
						"Text": "Not assigned"
					},
					"Key": "Common.None"
				},
				{
					"Source": {
						"Text": "OFFLINE"
					},
					"Translation": {
						"Text": "OFFLINE"
					},
					"Key": "Common.Offline"
				},
				{
					"Source": {
						"Text": "OFFLINE"
					},
					"Translation": {
						"Text": "OFFLINE"
					},
					"Key": "Launcher.OFFLINE"
				},
				{
					"Source": {
						"Text": "OFFLINE"
					},
					"Translation": {
						"Text": "OFFLINE"
					},
					"Key": "Stage1.Offline"
				},
				{
					"Source": {
						"Text": "OFFLINE / LOAD FAILED"
					},
					"Translation": {
						"Text": "OFFLINE / LOAD FAILED"
					},
					"Key": "Status.OFFLINE___LOAD_FAILED"
				},
				{
					"Source": {
						"Text": "ONLINE"
					},
					"Translation": {
						"Text": "ONLINE"
					},
					"Key": "Common.Online"
				},
				{
					"Source": {
						"Text": "ONLINE"
					},
					"Translation": {
						"Text": "ONLINE"
					},
					"Key": "Launcher.ONLINE"
				},
				{
					"Source": {
						"Text": "ONLINE"
					},
					"Translation": {
						"Text": "ONLINE"
					},
					"Key": "Stage1.Online"
				},
				{
					"Source": {
						"Text": "OPEN VIDEO"
					},
					"Translation": {
						"Text": "OPEN VIDEO"
					},
					"Key": "Video.Open"
				},
				{
					"Source": {
						"Text": "OPERATION"
					},
					"Translation": {
						"Text": "OPERATION"
					},
					"Key": "Status.OPERATION"
				},
				{
					"Source": {
						"Text": "Offline"
					},
					"Translation": {
						"Text": "Offline"
					},
					"Key": "Fleet.Offline"
				},
				{
					"Source": {
						"Text": "Online"
					},
					"Translation": {
						"Text": "Online"
					},
					"Key": "Fleet.Online"
				},
				{
					"Source": {
						"Text": "Only Line formation is currently available."
					},
					"Translation": {
						"Text": "Only Line formation is currently available."
					},
					"Key": "Errors.FORMATION_UNSUPPORTED"
				},
				{
					"Source": {
						"Text": "Open mission"
					},
					"Translation": {
						"Text": "Open mission"
					},
					"Key": "Execution.Open"
				},
				{
					"Source": {
						"Text": "Open plan"
					},
					"Translation": {
						"Text": "Open plan"
					},
					"Key": "Workflow.OpenPlan"
				},
				{
					"Source": {
						"Text": "Opened {plan_name}"
					},
					"Translation": {
						"Text": "Opened {plan_name}"
					},
					"Key": "Events.PLAN_OPENED"
				},
				{
					"Source": {
						"Text": "Operation failed:"
					},
					"Translation": {
						"Text": "Operation failed:"
					},
					"Key": "Launcher.Error"
				},
				{
					"Source": {
						"Text": "Operation mode changed: {target}"
					},
					"Translation": {
						"Text": "Operation mode changed: {target}"
					},
					"Key": "Events.operation_mode_changed"
				},
				{
					"Source": {
						"Text": "Overview"
					},
					"Translation": {
						"Text": "Overview"
					},
					"Key": "Nav.Overview"
				},
				{
					"Source": {
						"Text": "PAGE READY / WAITING VIDEO"
					},
					"Translation": {
						"Text": "PAGE READY / WAITING VIDEO"
					},
					"Key": "Status.PAGE_READY___WAITING_VIDEO"
				},
				{
					"Source": {
						"Text": "PERSON\n\nVEHICLE\n\nUAV\n\nBEHAVIOR\n\nOTHER"
					},
					"Translation": {
						"Text": "PERSON\n\nVEHICLE\n\nUAV\n\nBEHAVIOR\n\nOTHER"
					},
					"Key": "Video.Categories"
				},
				{
					"Source": {
						"Text": "PLAN"
					},
					"Translation": {
						"Text": "PLAN"
					},
					"Key": "Status.PLAN"
				},
				{
					"Source": {
						"Text": "PLAN_EDIT"
					},
					"Translation": {
						"Text": "PLAN_EDIT"
					},
					"Key": "Status.PLAN_EDIT"
				},
				{
					"Source": {
						"Text": "PLAYBACK"
					},
					"Translation": {
						"Text": "PLAYBACK"
					},
					"Key": "Status.PLAYBACK"
				},
				{
					"Source": {
						"Text": "PLAYING"
					},
					"Translation": {
						"Text": "PLAYING"
					},
					"Key": "Status.PLAYING"
				},
				{
					"Source": {
						"Text": "PRIMARY"
					},
					"Translation": {
						"Text": "PRIMARY"
					},
					"Key": "Fleet.Primary"
				},
				{
					"Source": {
						"Text": "PRIMARY VIDEO"
					},
					"Translation": {
						"Text": "PRIMARY VIDEO"
					},
					"Key": "Video.Primary"
				},
				{
					"Source": {
						"Text": "PRIMARY VIDEO / {0}"
					},
					"Translation": {
						"Text": "PRIMARY VIDEO / {0}"
					},
					"Key": "Video.Heading"
				},
				{
					"Source": {
						"Text": "Pause mission"
					},
					"Translation": {
						"Text": "Pause mission"
					},
					"Key": "Execution.Pause"
				},
				{
					"Source": {
						"Text": "Plan name"
					},
					"Translation": {
						"Text": "Plan name"
					},
					"Key": "Plan.Name"
				},
				{
					"Source": {
						"Text": "Plan position confirmed"
					},
					"Translation": {
						"Text": "Plan position confirmed"
					},
					"Key": "Events.PLAN_TRANSLATED"
				},
				{
					"Source": {
						"Text": "Plan selected: {target}"
					},
					"Translation": {
						"Text": "Plan selected: {target}"
					},
					"Key": "Events.active_security_plan_id_changed"
				},
				{
					"Source": {
						"Text": "Plan {plan_name} configuration checked"
					},
					"Translation": {
						"Text": "Plan {plan_name} configuration checked"
					},
					"Key": "Events.PLAN_VALIDATED"
				},
				{
					"Source": {
						"Text": "Plan {plan_name} copied as draft"
					},
					"Translation": {
						"Text": "Plan {plan_name} copied as draft"
					},
					"Key": "Events.PLAN_COPIED"
				},
				{
					"Source": {
						"Text": "Plan {plan_name} created"
					},
					"Translation": {
						"Text": "Plan {plan_name} created"
					},
					"Key": "Events.PLAN_CREATED"
				},
				{
					"Source": {
						"Text": "Plan {plan_name} deployed. Execution has not started."
					},
					"Translation": {
						"Text": "Plan {plan_name} deployed. Execution has not started."
					},
					"Key": "Events.PLAN_DEPLOYED"
				},
				{
					"Source": {
						"Text": "Plan {plan_name} reviewed"
					},
					"Translation": {
						"Text": "Plan {plan_name} reviewed"
					},
					"Key": "Events.PLAN_REVIEWED"
				},
				{
					"Source": {
						"Text": "Plan {plan_name} updated"
					},
					"Translation": {
						"Text": "Plan {plan_name} updated"
					},
					"Key": "Events.PLAN_UPDATED"
				},
				{
					"Source": {
						"Text": "Pre-deployment check"
					},
					"Translation": {
						"Text": "Pre-deployment check"
					},
					"Key": "Workflow.PreDeployReview"
				},
				{
					"Source": {
						"Text": "Pre-deployment check ready: {plan_name}"
					},
					"Translation": {
						"Text": "Pre-deployment check ready: {plan_name}"
					},
					"Key": "Events.PLAN_REVIEW_READY"
				},
				{
					"Source": {
						"Text": "Preview only — confirm position to save."
					},
					"Translation": {
						"Text": "Preview only — confirm position to save."
					},
					"Key": "Geometry.Preview"
				},
				{
					"Source": {
						"Text": "P{0} | {1} m {2} | Hover {3} s"
					},
					"Translation": {
						"Text": "P{0} | {1} m {2} | Hover {3} s"
					},
					"Key": "Mission3D.Marker"
				},
				{
					"Source": {
						"Text": "RECENT ALERTS"
					},
					"Translation": {
						"Text": "RECENT ALERTS"
					},
					"Key": "Video.RecentAlerts"
				},
				{
					"Source": {
						"Text": "RECONNECTING"
					},
					"Translation": {
						"Text": "RECONNECTING"
					},
					"Key": "Common.Reconnecting"
				},
				{
					"Source": {
						"Text": "RECONNECTING"
					},
					"Translation": {
						"Text": "RECONNECTING"
					},
					"Key": "Launcher.RECONNECTING"
				},
				{
					"Source": {
						"Text": "RECORD"
					},
					"Translation": {
						"Text": "RECORD"
					},
					"Key": "Status.RECORD"
				},
				{
					"Source": {
						"Text": "REMOVE RECORD"
					},
					"Translation": {
						"Text": "REMOVE RECORD"
					},
					"Key": "Command.Remove"
				},
				{
					"Source": {
						"Text": "RENAME"
					},
					"Translation": {
						"Text": "RENAME"
					},
					"Key": "Common.Rename"
				},
				{
					"Source": {
						"Text": "RENAME TASK"
					},
					"Translation": {
						"Text": "RENAME TASK"
					},
					"Key": "Plan.Rename"
				},
				{
					"Source": {
						"Text": "REQUEST PAUSE"
					},
					"Translation": {
						"Text": "REQUEST PAUSE"
					},
					"Key": "Command.Pause"
				},
				{
					"Source": {
						"Text": "REQUEST RESUME"
					},
					"Translation": {
						"Text": "REQUEST RESUME"
					},
					"Key": "Command.Resume"
				},
				{
					"Source": {
						"Text": "RESCHEDULE"
					},
					"Translation": {
						"Text": "RESCHEDULE"
					},
					"Key": "Schedule.Reschedule"
				},
				{
					"Source": {
						"Text": "RESERVED"
					},
					"Translation": {
						"Text": "RESERVED"
					},
					"Key": "Status.RESERVED"
				},
				{
					"Source": {
						"Text": "RESERVED\nNO UAV ASSIGNED"
					},
					"Translation": {
						"Text": "RESERVED\nNO UAV ASSIGNED"
					},
					"Key": "Video.Reserved"
				},
				{
					"Source": {
						"Text": "RETRY"
					},
					"Translation": {
						"Text": "RETRY"
					},
					"Key": "Video.Retry"
				},
				{
					"Source": {
						"Text": "RETRYING"
					},
					"Translation": {
						"Text": "RETRYING"
					},
					"Key": "Status.RETRYING"
				},
				{
					"Source": {
						"Text": "REVIEW PLAN"
					},
					"Translation": {
						"Text": "REVIEW PLAN"
					},
					"Key": "Plan.Review"
				},
				{
					"Source": {
						"Text": "ROUTE EDITING | MAP VIEW LOCKED"
					},
					"Translation": {
						"Text": "ROUTE EDITING | MAP VIEW LOCKED"
					},
					"Key": "Map.ViewLocked"
				},
				{
					"Source": {
						"Text": "ROUTE VISUAL  |  Low → High\nAltitude {0}–{1} m ({4})\nSpeed {2}–{3} m/s · Slow ▶  Fast ▶▶▶\nDirection →  |  Conflict: red pulse"
					},
					"Translation": {
						"Text": "ROUTE VISUAL  |  Low → High\nAltitude {0}–{1} m ({4})\nSpeed {2}–{3} m/s · Slow ▶  Fast ▶▶▶\nDirection →  |  Conflict: red pulse"
					},
					"Key": "RouteVisual.Legend"
				},
				{
					"Source": {
						"Text": "Real UAV or its calibrated frame is unavailable."
					},
					"Translation": {
						"Text": "Real UAV or its calibrated frame is unavailable."
					},
					"Key": "Errors.REAL_UAV_UNAVAILABLE"
				},
				{
					"Source": {
						"Text": "Real UAV rejected the command. Verify Armed/Offboard and telemetry."
					},
					"Translation": {
						"Text": "Real UAV rejected the command. Verify Armed/Offboard and telemetry."
					},
					"Key": "Errors.REAL_COMMAND_REJECTED"
				},
				{
					"Source": {
						"Text": "Real adapter configuration is incomplete or invalid."
					},
					"Translation": {
						"Text": "Real adapter configuration is incomplete or invalid."
					},
					"Key": "Errors.REAL_CONFIGURATION_INVALID"
				},
				{
					"Source": {
						"Text": "Real adapter configured; Backend checks live readiness"
					},
					"Translation": {
						"Text": "Real adapter configured; Backend checks live readiness"
					},
					"Key": "Execution.RealAvailable"
				},
				{
					"Source": {
						"Text": "Real control requires fresh measured telemetry, calibrated coordinates and Armed/Offboard before movement. Start does not arm or take off."
					},
					"Translation": {
						"Text": "Real control requires fresh measured telemetry, calibrated coordinates and Armed/Offboard before movement. Start does not arm or take off."
					},
					"Key": "Execution.RealCheck"
				},
				{
					"Source": {
						"Text": "Real execution estimates are calculated from live position by Backend at start."
					},
					"Translation": {
						"Text": "Real execution estimates are calculated from live position by Backend at start."
					},
					"Key": "Execution.RealEstimate"
				},
				{
					"Source": {
						"Text": "Real mission restored paused; verify the aircraft before resuming."
					},
					"Translation": {
						"Text": "Real mission restored paused; verify the aircraft before resuming."
					},
					"Key": "Errors.REAL_RESTART_REQUIRES_RESUME"
				},
				{
					"Source": {
						"Text": "Recent events"
					},
					"Translation": {
						"Text": "Recent events"
					},
					"Key": "Workflow.RecentEvents"
				},
				{
					"Source": {
						"Text": "Request failed. Confirm the current selection and retry."
					},
					"Translation": {
						"Text": "Request failed. Confirm the current selection and retry."
					},
					"Key": "Errors.Request"
				},
				{
					"Source": {
						"Text": "Request identifier conflict."
					},
					"Translation": {
						"Text": "Request identifier conflict."
					},
					"Key": "Errors.REQUEST_ID_REUSED"
				},
				{
					"Source": {
						"Text": "Request results require Backend confirmation. Use Map for route editing."
					},
					"Translation": {
						"Text": "Request results require Backend confirmation. Use Map for route editing."
					},
					"Key": "Command.ActionNotice"
				},
				{
					"Source": {
						"Text": "Reserved fields\nTitle · UAV · Target\nTimestamp · Severity"
					},
					"Translation": {
						"Text": "Reserved fields\nTitle · UAV · Target\nTimestamp · Severity"
					},
					"Key": "Video.ReservedFields"
				},
				{
					"Source": {
						"Text": "Reserved for future integration"
					},
					"Translation": {
						"Text": "Reserved for future integration"
					},
					"Key": "Common.Reserved"
				},
				{
					"Source": {
						"Text": "Restart"
					},
					"Translation": {
						"Text": "Restart"
					},
					"Key": "Launcher.Restart"
				},
				{
					"Source": {
						"Text": "Resume mission"
					},
					"Translation": {
						"Text": "Resume mission"
					},
					"Key": "Execution.Resume"
				},
				{
					"Source": {
						"Text": "Return Home"
					},
					"Translation": {
						"Text": "Return Home"
					},
					"Key": "Execution.Return"
				},
				{
					"Source": {
						"Text": "Return to task configuration"
					},
					"Translation": {
						"Text": "Return to task configuration"
					},
					"Key": "Workflow.BackEdit"
				},
				{
					"Source": {
						"Text": "Returned to simulation Home"
					},
					"Translation": {
						"Text": "Returned to simulation Home"
					},
					"Key": "Execution.RETURNED_HOME"
				},
				{
					"Source": {
						"Text": "Returning Home"
					},
					"Translation": {
						"Text": "Returning Home"
					},
					"Key": "Execution.RETURNING"
				},
				{
					"Source": {
						"Text": "Returning Home · {uav_id}"
					},
					"Translation": {
						"Text": "Returning Home · {uav_id}"
					},
					"Key": "Events.MISSION_RETURNING"
				},
				{
					"Source": {
						"Text": "Review is stale. Review the current revision again."
					},
					"Translation": {
						"Text": "Review is stale. Review the current revision again."
					},
					"Key": "Errors.REVIEW_STALE"
				},
				{
					"Source": {
						"Text": "Review the current configuration first."
					},
					"Translation": {
						"Text": "Review the current configuration first."
					},
					"Key": "Errors.PLAN_REVIEW_REQUIRED"
				},
				{
					"Source": {
						"Text": "Reviewed revision {0}"
					},
					"Translation": {
						"Text": "Reviewed revision {0}"
					},
					"Key": "Plan.Reviewed"
				},
				{
					"Source": {
						"Text": "Revision {0}"
					},
					"Translation": {
						"Text": "Revision {0}"
					},
					"Key": "Plan.Revision"
				},
				{
					"Source": {
						"Text": "Route"
					},
					"Translation": {
						"Text": "Route"
					},
					"Key": "Workflow.StepRoute"
				},
				{
					"Source": {
						"Text": "Route distance: {0} m"
					},
					"Translation": {
						"Text": "Route distance: {0} m"
					},
					"Key": "Workflow.ReviewDistance"
				},
				{
					"Source": {
						"Text": "Route draft saved: {mission_name}"
					},
					"Translation": {
						"Text": "Route draft saved: {mission_name}"
					},
					"Key": "Events.ROUTE_SAVED"
				},
				{
					"Source": {
						"Text": "Route editing"
					},
					"Translation": {
						"Text": "Route editing"
					},
					"Key": "Workflow.RouteEditing"
				},
				{
					"Source": {
						"Text": "Route editing completed: {mission_name}"
					},
					"Translation": {
						"Text": "Route editing completed: {mission_name}"
					},
					"Key": "Events.ROUTE_EDIT_COMPLETED"
				},
				{
					"Source": {
						"Text": "Route editing in progress: {0}. Review and deployment are blocked."
					},
					"Translation": {
						"Text": "Route editing in progress: {0}. Review and deployment are blocked."
					},
					"Key": "Plan.EditingBlock"
				},
				{
					"Source": {
						"Text": "Route editing started: {mission_name}"
					},
					"Translation": {
						"Text": "Route editing started: {mission_name}"
					},
					"Key": "Events.ROUTE_EDIT_STARTED"
				},
				{
					"Source": {
						"Text": "Route requires at least 2 waypoints."
					},
					"Translation": {
						"Text": "Route requires at least 2 waypoints."
					},
					"Key": "Errors.ROUTE_TOO_SHORT"
				},
				{
					"Source": {
						"Text": "SAVE"
					},
					"Translation": {
						"Text": "SAVE"
					},
					"Key": "Common.Save"
				},
				{
					"Source": {
						"Text": "SAVE ASSIGNED UAVS"
					},
					"Translation": {
						"Text": "SAVE ASSIGNED UAVS"
					},
					"Key": "Formation.SaveAssignment"
				},
				{
					"Source": {
						"Text": "SAVE PLAN INFORMATION"
					},
					"Translation": {
						"Text": "SAVE PLAN INFORMATION"
					},
					"Key": "Plan.Update"
				},
				{
					"Source": {
						"Text": "SAVED / READ ONLY"
					},
					"Translation": {
						"Text": "SAVED / READ ONLY"
					},
					"Key": "Map.CLEAN"
				},
				{
					"Source": {
						"Text": "SAVING"
					},
					"Translation": {
						"Text": "SAVING"
					},
					"Key": "Map.SAVING"
				},
				{
					"Source": {
						"Text": "SCHEDULED"
					},
					"Translation": {
						"Text": "SCHEDULED"
					},
					"Key": "Execution.SCHEDULED"
				},
				{
					"Source": {
						"Text": "SCREENSHOT"
					},
					"Translation": {
						"Text": "SCREENSHOT"
					},
					"Key": "Status.SCREENSHOT"
				},
				{
					"Source": {
						"Text": "SECURITY COMMAND CENTER"
					},
					"Translation": {
						"Text": "SECURITY COMMAND CENTER"
					},
					"Key": "Command.Title"
				},
				{
					"Source": {
						"Text": "SECURITY PLAN"
					},
					"Translation": {
						"Text": "SECURITY PLAN"
					},
					"Key": "Plan.Title"
				},
				{
					"Source": {
						"Text": "SELECT"
					},
					"Translation": {
						"Text": "SELECT"
					},
					"Key": "Common.Select"
				},
				{
					"Source": {
						"Text": "SELECT UAV"
					},
					"Translation": {
						"Text": "SELECT UAV"
					},
					"Key": "Command.Select"
				},
				{
					"Source": {
						"Text": "SELECT VIDEO TARGET"
					},
					"Translation": {
						"Text": "SELECT VIDEO TARGET"
					},
					"Key": "Video.SelectFeed"
				},
				{
					"Source": {
						"Text": "SELECTED"
					},
					"Translation": {
						"Text": "SELECTED"
					},
					"Key": "Common.Selected"
				},
				{
					"Source": {
						"Text": "SET AS ACTIVE UAV"
					},
					"Translation": {
						"Text": "SET AS ACTIVE UAV"
					},
					"Key": "Video.SetActive"
				},
				{
					"Source": {
						"Text": "SIMULATION · Mock UAV"
					},
					"Translation": {
						"Text": "SIMULATION · Mock UAV"
					},
					"Key": "Execution.Simulation"
				},
				{
					"Source": {
						"Text": "SINGLE ACTIVE PLAYER · Secondary feeds are reserved slots · No AI backend connected"
					},
					"Translation": {
						"Text": "SINGLE ACTIVE PLAYER · Secondary feeds are reserved slots · No AI backend connected"
					},
					"Key": "Video.Single"
				},
				{
					"Source": {
						"Text": "SINGLE-SCREEN MULTI-WINDOW  |  Focus a window for detailed work"
					},
					"Translation": {
						"Text": "SINGLE-SCREEN MULTI-WINDOW  |  Focus a window for detailed work"
					},
					"Key": "Launcher.Layout"
				},
				{
					"Source": {
						"Text": "SOURCE SET"
					},
					"Translation": {
						"Text": "SOURCE SET"
					},
					"Key": "Status.SOURCE_SET"
				},
				{
					"Source": {
						"Text": "STALLED / NO FRAMES"
					},
					"Translation": {
						"Text": "STALLED / NO FRAMES"
					},
					"Key": "Status.STALLED___NO_FRAMES"
				},
				{
					"Source": {
						"Text": "START NOW"
					},
					"Translation": {
						"Text": "START NOW"
					},
					"Key": "Schedule.StartNow"
				},
				{
					"Source": {
						"Text": "STARTING"
					},
					"Translation": {
						"Text": "STARTING"
					},
					"Key": "Launcher.STARTING"
				},
				{
					"Source": {
						"Text": "STOPPED"
					},
					"Translation": {
						"Text": "STOPPED"
					},
					"Key": "Launcher.STOPPED"
				},
				{
					"Source": {
						"Text": "STOPPING"
					},
					"Translation": {
						"Text": "STOPPING"
					},
					"Key": "Launcher.STOPPING"
				},
				{
					"Source": {
						"Text": "SYSTEM"
					},
					"Translation": {
						"Text": "SYSTEM"
					},
					"Key": "Status.SYSTEM"
				},
				{
					"Source": {
						"Text": "SYSTEM DEGRADED"
					},
					"Translation": {
						"Text": "SYSTEM DEGRADED"
					},
					"Key": "Launcher.DEGRADED"
				},
				{
					"Source": {
						"Text": "SYSTEM DEGRADED"
					},
					"Translation": {
						"Text": "SYSTEM DEGRADED"
					},
					"Key": "Stage1.System.DEGRADED"
				},
				{
					"Source": {
						"Text": "SYSTEM ONLINE: N/A | {0} UAVs | {1} VIEW POSITIONS | {2} PLAYING | AI: NOT CONNECTED | {3}"
					},
					"Translation": {
						"Text": "SYSTEM ONLINE: N/A | {0} UAVs | {1} VIEW POSITIONS | {2} PLAYING | AI: NOT CONNECTED | {3}"
					},
					"Key": "Video.System"
				},
				{
					"Source": {
						"Text": "SYSTEM READY"
					},
					"Translation": {
						"Text": "SYSTEM READY"
					},
					"Key": "Launcher.READY"
				},
				{
					"Source": {
						"Text": "SYSTEM READY"
					},
					"Translation": {
						"Text": "SYSTEM READY"
					},
					"Key": "Stage1.System.READY"
				},
				{
					"Source": {
						"Text": "Save and exit"
					},
					"Translation": {
						"Text": "Save and exit"
					},
					"Key": "Workflow.SaveExit"
				},
				{
					"Source": {
						"Text": "Save draft"
					},
					"Translation": {
						"Text": "Save draft"
					},
					"Key": "Workflow.SaveDraft"
				},
				{
					"Source": {
						"Text": "Saved · editing continues"
					},
					"Translation": {
						"Text": "Saved · editing continues"
					},
					"Key": "Map.SAVED"
				},
				{
					"Source": {
						"Text": "Scheduled mission starts in {0}"
					},
					"Translation": {
						"Text": "Scheduled mission starts in {0}"
					},
					"Key": "Schedule.Countdown"
				},
				{
					"Source": {
						"Text": "Scheduled start (unchecked: start now)"
					},
					"Translation": {
						"Text": "Scheduled start (unchecked: start now)"
					},
					"Key": "Schedule.Enable"
				},
				{
					"Source": {
						"Text": "Scheduled: {0} | Starts in {1} | {2} UAV"
					},
					"Translation": {
						"Text": "Scheduled: {0} | Starts in {1} | {2} UAV"
					},
					"Key": "Schedule.Overview"
				},
				{
					"Source": {
						"Text": "Security Plans"
					},
					"Translation": {
						"Text": "Security Plans"
					},
					"Key": "Nav.Plans"
				},
				{
					"Source": {
						"Text": "Select a UAV here or on the map."
					},
					"Translation": {
						"Text": "Select a UAV here or on the map."
					},
					"Key": "Map.Select"
				},
				{
					"Source": {
						"Text": "Select a registered UAV video target."
					},
					"Translation": {
						"Text": "Select a registered UAV video target."
					},
					"Key": "Errors.INVALID_VIDEO_TARGET"
				},
				{
					"Source": {
						"Text": "Select a waypoint to edit height and hover time"
					},
					"Translation": {
						"Text": "Select a waypoint to edit height and hover time"
					},
					"Key": "Mission3D.SelectPoint"
				},
				{
					"Source": {
						"Text": "Select the Map window or use Launcher Focus."
					},
					"Translation": {
						"Text": "Select the Map window or use Launcher Focus."
					},
					"Key": "Errors.MAP_FOCUS_MANUAL"
				},
				{
					"Source": {
						"Text": "Selected UAVs: {0} | Preserve relative offsets | Minimum separation: {1} m"
					},
					"Translation": {
						"Text": "Selected UAVs: {0} | Preserve relative offsets | Minimum separation: {1} m"
					},
					"Key": "Group.Summary"
				},
				{
					"Source": {
						"Text": "Selected Waypoint: P{0}"
					},
					"Translation": {
						"Text": "Selected Waypoint: P{0}"
					},
					"Key": "Mission3D.Selected"
				},
				{
					"Source": {
						"Text": "Shutdown System"
					},
					"Translation": {
						"Text": "Shutdown System"
					},
					"Key": "Launcher.Shutdown"
				},
				{
					"Source": {
						"Text": "Simulation preflight checks deployment, route, Mock UAV availability and execution conflicts. Backend confirms every action."
					},
					"Translation": {
						"Text": "Simulation preflight checks deployment, route, Mock UAV availability and execution conflicts. Backend confirms every action."
					},
					"Key": "Execution.MockCheck"
				},
				{
					"Source": {
						"Text": "Simulation preflight passed · {uav_id}"
					},
					"Translation": {
						"Text": "Simulation preflight passed · {uav_id}"
					},
					"Key": "Events.PREFLIGHT_PASSED"
				},
				{
					"Source": {
						"Text": "Simulation preflight started · {uav_id}"
					},
					"Translation": {
						"Text": "Simulation preflight started · {uav_id}"
					},
					"Key": "Events.PREFLIGHT_STARTED"
				},
				{
					"Source": {
						"Text": "Spacing must meet the configured minimum separation."
					},
					"Translation": {
						"Text": "Spacing must meet the configured minimum separation."
					},
					"Key": "Errors.INVALID_SEPARATION"
				},
				{
					"Source": {
						"Text": "Speed (m/s; 0 = default)"
					},
					"Translation": {
						"Text": "Speed (m/s; 0 = default)"
					},
					"Key": "Inspector.Speed"
				},
				{
					"Source": {
						"Text": "Start Mission →"
					},
					"Translation": {
						"Text": "Start Mission →"
					},
					"Key": "Execution.Start"
				},
				{
					"Source": {
						"Text": "Starting mission…"
					},
					"Translation": {
						"Text": "Starting mission…"
					},
					"Key": "Execution.STARTING"
				},
				{
					"Source": {
						"Text": "Stop"
					},
					"Translation": {
						"Text": "Stop"
					},
					"Key": "Launcher.Stop"
				},
				{
					"Source": {
						"Text": "Stored execution belongs to a different adapter. Create a new execution."
					},
					"Translation": {
						"Text": "Stored execution belongs to a different adapter. Create a new execution."
					},
					"Key": "Errors.ADAPTER_MODE_MISMATCH"
				},
				{
					"Source": {
						"Text": "Switch to Map / Retry"
					},
					"Translation": {
						"Text": "Switch to Map / Retry"
					},
					"Key": "Workflow.ReturnMap"
				},
				{
					"Source": {
						"Text": "Synchronization failed. Last confirmed state retained."
					},
					"Translation": {
						"Text": "Synchronization failed. Last confirmed state retained."
					},
					"Key": "Errors.SYNC_FAILED"
				},
				{
					"Source": {
						"Text": "TACTICAL DATA"
					},
					"Translation": {
						"Text": "TACTICAL DATA"
					},
					"Key": "Command.Tactical"
				},
				{
					"Source": {
						"Text": "TACTICAL MAP"
					},
					"Translation": {
						"Text": "TACTICAL MAP"
					},
					"Key": "Stage1.Map"
				},
				{
					"Source": {
						"Text": "TARGET UAV {0} | {1}"
					},
					"Translation": {
						"Text": "TARGET UAV {0} | {1}"
					},
					"Key": "Alarm.Target"
				},
				{
					"Source": {
						"Text": "TOGGLE FOLLOW SELECTED UAV"
					},
					"Translation": {
						"Text": "TOGGLE FOLLOW SELECTED UAV"
					},
					"Key": "Situation.Follow"
				},
				{
					"Source": {
						"Text": "Task"
					},
					"Translation": {
						"Text": "Task"
					},
					"Key": "Plan.Mission"
				},
				{
					"Source": {
						"Text": "Task 01"
					},
					"Translation": {
						"Text": "Task 01"
					},
					"Key": "Workflow.DefaultTask"
				},
				{
					"Source": {
						"Text": "Task configuration"
					},
					"Translation": {
						"Text": "Task configuration"
					},
					"Key": "Workflow.TaskConfig"
				},
				{
					"Source": {
						"Text": "Task configured: {mission_name} · {uav_id}"
					},
					"Translation": {
						"Text": "Task configured: {mission_name} · {uav_id}"
					},
					"Key": "Events.MISSION_CONFIGURED"
				},
				{
					"Source": {
						"Text": "Task name"
					},
					"Translation": {
						"Text": "Task name"
					},
					"Key": "Plan.MissionName"
				},
				{
					"Source": {
						"Text": "Task type: Patrol"
					},
					"Translation": {
						"Text": "Task type: Patrol"
					},
					"Key": "Workflow.Patrol"
				},
				{
					"Source": {
						"Text": "Tasks"
					},
					"Translation": {
						"Text": "Tasks"
					},
					"Key": "Workflow.StepTask"
				},
				{
					"Source": {
						"Text": "Tasks: {0} | UAV assigned: {1} | Routes configured: {2}"
					},
					"Translation": {
						"Text": "Tasks: {0} | UAV assigned: {1} | Routes configured: {2}"
					},
					"Key": "Plan.Counts"
				},
				{
					"Source": {
						"Text": "Terrain height is unavailable or the waypoint is below ground. Load terrain and retry."
					},
					"Translation": {
						"Text": "Terrain height is unavailable or the waypoint is below ground. Load terrain and retry."
					},
					"Key": "Errors.TERRAIN_REQUIRED"
				},
				{
					"Source": {
						"Text": "The assigned UAV is not in the Registry."
					},
					"Translation": {
						"Text": "The assigned UAV is not in the Registry."
					},
					"Key": "Errors.INVALID_UAV"
				},
				{
					"Source": {
						"Text": "The deployed route snapshot is missing."
					},
					"Translation": {
						"Text": "The deployed route snapshot is missing."
					},
					"Key": "Errors.IMMUTABLE_ROUTE_MISSING"
				},
				{
					"Source": {
						"Text": "The live coordinate anchor changed. Recalibrate before control."
					},
					"Translation": {
						"Text": "The live coordinate anchor changed. Recalibrate before control."
					},
					"Key": "Errors.REAL_ANCHOR_CHANGED_RECALIBRATE"
				},
				{
					"Source": {
						"Text": "The motion target or speed is invalid."
					},
					"Translation": {
						"Text": "The motion target or speed is invalid."
					},
					"Key": "Errors.ADAPTER_COMMAND_INVALID"
				},
				{
					"Source": {
						"Text": "The real coordinate calibration is invalid."
					},
					"Translation": {
						"Text": "The real coordinate calibration is invalid."
					},
					"Key": "Errors.REAL_ANCHOR_INVALID"
				},
				{
					"Source": {
						"Text": "The real mission is outside the supported local coordinate area."
					},
					"Translation": {
						"Text": "The real mission is outside the supported local coordinate area."
					},
					"Key": "Errors.REAL_FRAME_DOMAIN_UNSUPPORTED"
				},
				{
					"Source": {
						"Text": "The route changed. Cancel and retry moving the plan."
					},
					"Translation": {
						"Text": "The route changed. Cancel and retry moving the plan."
					},
					"Key": "Errors.INVALID_TRANSLATION"
				},
				{
					"Source": {
						"Text": "The server rejected this request. Refresh and retry."
					},
					"Translation": {
						"Text": "The server rejected this request. Refresh and retry."
					},
					"Key": "Errors.REQUEST_REJECTED"
				},
				{
					"Source": {
						"Text": "This UAV already has an active mission."
					},
					"Translation": {
						"Text": "This UAV already has an active mission."
					},
					"Key": "Errors.EXECUTION_CONFLICT"
				},
				{
					"Source": {
						"Text": "This UAV is assigned to another mission in this plan."
					},
					"Translation": {
						"Text": "This UAV is assigned to another mission in this plan."
					},
					"Key": "Errors.UAV_ALREADY_ASSIGNED"
				},
				{
					"Source": {
						"Text": "This action is unavailable in the current mission state."
					},
					"Translation": {
						"Text": "This action is unavailable in the current mission state."
					},
					"Key": "Errors.EXECUTION_STATE_INVALID"
				},
				{
					"Source": {
						"Text": "This client cannot perform this action."
					},
					"Translation": {
						"Text": "This client cannot perform this action."
					},
					"Key": "Errors.ROLE_FORBIDDEN"
				},
				{
					"Source": {
						"Text": "This review confirms the current plan configuration. Deployment freezes the business configuration and does not start aircraft execution."
					},
					"Translation": {
						"Text": "This review confirms the current plan configuration. Deployment freezes the business configuration and does not start aircraft execution."
					},
					"Key": "Plan.ReviewNotice"
				},
				{
					"Source": {
						"Text": "Trajectory conflict: aircraft cannot maintain the required separation."
					},
					"Translation": {
						"Text": "Trajectory conflict: aircraft cannot maintain the required separation."
					},
					"Key": "Errors.TRAJECTORY_CONFLICT"
				},
				{
					"Source": {
						"Text": "UAV DETAILS / ACTIONS"
					},
					"Translation": {
						"Text": "UAV DETAILS / ACTIONS"
					},
					"Key": "Command.Details"
				},
				{
					"Source": {
						"Text": "UAV FLEET"
					},
					"Translation": {
						"Text": "UAV FLEET"
					},
					"Key": "Command.Fleet"
				},
				{
					"Source": {
						"Text": "UAV Fleet"
					},
					"Translation": {
						"Text": "UAV Fleet"
					},
					"Key": "Nav.Fleet"
				},
				{
					"Source": {
						"Text": "UAV ONLINE: N/A\nAI ENGINE: NOT CONNECTED\nSTORAGE: N/A\nNETWORK: N/A"
					},
					"Translation": {
						"Text": "UAV ONLINE: N/A\nAI ENGINE: NOT CONNECTED\nSTORAGE: N/A\nNETWORK: N/A"
					},
					"Key": "Video.ReservedStatus"
				},
				{
					"Source": {
						"Text": "UAV VIDEO MONITOR CENTER"
					},
					"Translation": {
						"Text": "UAV VIDEO MONITOR CENTER"
					},
					"Key": "Video.Title"
				},
				{
					"Source": {
						"Text": "UAV {0} | BAT {1}\nMISSION {2}"
					},
					"Translation": {
						"Text": "UAV {0} | BAT {1}\nMISSION {2}"
					},
					"Key": "Fleet.Summary"
				},
				{
					"Source": {
						"Text": "UNASSIGN UAV"
					},
					"Translation": {
						"Text": "UNASSIGN UAV"
					},
					"Key": "Plan.Unassign"
				},
				{
					"Source": {
						"Text": "Undo"
					},
					"Translation": {
						"Text": "Undo"
					},
					"Key": "Workflow.Undo"
				},
				{
					"Source": {
						"Text": "Unknown"
					},
					"Translation": {
						"Text": "Unknown"
					},
					"Key": "Fleet.Unknown"
				},
				{
					"Source": {
						"Text": "Unknown altitude reference"
					},
					"Translation": {
						"Text": "Unknown altitude reference"
					},
					"Key": "Errors.INVALID_ALTITUDE_REFERENCE"
				},
				{
					"Source": {
						"Text": "Unsaved route changes. Save, discard, or cancel before leaving."
					},
					"Translation": {
						"Text": "Unsaved route changes. Save, discard, or cancel before leaving."
					},
					"Key": "Map.DirtyPrompt"
				},
				{
					"Source": {
						"Text": "Unsupported language."
					},
					"Translation": {
						"Text": "Unsupported language."
					},
					"Key": "Errors.INVALID_LANGUAGE"
				},
				{
					"Source": {
						"Text": "Use the security mission controls in Real mode."
					},
					"Translation": {
						"Text": "Use the security mission controls in Real mode."
					},
					"Key": "Errors.MISSION_CONTROLLER_OWNS_CONTROL"
				},
				{
					"Source": {
						"Text": "VIDEO INTELLIGENCE"
					},
					"Translation": {
						"Text": "VIDEO INTELLIGENCE"
					},
					"Key": "Stage1.Video"
				},
				{
					"Source": {
						"Text": "VIDEO SLOT\nNO ACTIVE STREAM"
					},
					"Translation": {
						"Text": "VIDEO SLOT\nNO ACTIVE STREAM"
					},
					"Key": "Status.VIDEO_SLOT_NO_ACTIVE_STREAM"
				},
				{
					"Source": {
						"Text": "VIDEO TARGET"
					},
					"Translation": {
						"Text": "VIDEO TARGET"
					},
					"Key": "Video.Target"
				},
				{
					"Source": {
						"Text": "VIEW ACTIVE UAV VIDEO"
					},
					"Translation": {
						"Text": "VIEW ACTIVE UAV VIDEO"
					},
					"Key": "Video.Active"
				},
				{
					"Source": {
						"Text": "VIEW ASSIGNED UAV VIDEO"
					},
					"Translation": {
						"Text": "VIEW ASSIGNED UAV VIDEO"
					},
					"Key": "Video.Assigned"
				},
				{
					"Source": {
						"Text": "Version conflict. Local draft retained. Discard and reload to resolve."
					},
					"Translation": {
						"Text": "Version conflict. Local draft retained. Discard and reload to resolve."
					},
					"Key": "Errors.VERSION_CONFLICT"
				},
				{
					"Source": {
						"Text": "View mission UAV video"
					},
					"Translation": {
						"Text": "View mission UAV video"
					},
					"Key": "Execution.Video"
				},
				{
					"Source": {
						"Text": "WARNING"
					},
					"Translation": {
						"Text": "WARNING"
					},
					"Key": "Alarm.Warning"
				},
				{
					"Source": {
						"Text": "WARNING"
					},
					"Translation": {
						"Text": "WARNING"
					},
					"Key": "Status.WARNING"
				},
				{
					"Source": {
						"Text": "Waiting for Backend confirmation..."
					},
					"Translation": {
						"Text": "Waiting for Backend confirmation..."
					},
					"Key": "Common.Waiting"
				},
				{
					"Source": {
						"Text": "Waiting for Registry"
					},
					"Translation": {
						"Text": "Waiting for Registry"
					},
					"Key": "Command.Waiting"
				},
				{
					"Source": {
						"Text": "Waypoint Inspector"
					},
					"Translation": {
						"Text": "Waypoint Inspector"
					},
					"Key": "Inspector.Title"
				},
				{
					"Source": {
						"Text": "Waypoint coordinates or parameters are invalid."
					},
					"Translation": {
						"Text": "Waypoint coordinates or parameters are invalid."
					},
					"Key": "Errors.INVALID_WAYPOINT"
				},
				{
					"Source": {
						"Text": "Waypoint reached · {uav_id}"
					},
					"Translation": {
						"Text": "Waypoint reached · {uav_id}"
					},
					"Key": "Events.WAYPOINT_REACHED"
				},
				{
					"Source": {
						"Text": "Waypoint {0}  ·  Height {1} m  ·  Speed {2} m/s"
					},
					"Translation": {
						"Text": "Waypoint {0}  ·  Height {1} m  ·  Speed {2} m/s"
					},
					"Key": "Workflow.Waypoint"
				},
				{
					"Source": {
						"Text": "Waypoints: {0}"
					},
					"Translation": {
						"Text": "Waypoints: {0}"
					},
					"Key": "Map.Count"
				},
				{
					"Source": {
						"Text": "World height"
					},
					"Translation": {
						"Text": "World height"
					},
					"Key": "RouteVisual.WorldHeight"
				},
				{
					"Source": {
						"Text": "{0}\nConfigured visual: {1}\nAircraft model is not supplied by Descriptor."
					},
					"Translation": {
						"Text": "{0}\nConfigured visual: {1}\nAircraft model is not supplied by Descriptor."
					},
					"Key": "Video.DescriptorTip"
				},
				{
					"Source": {
						"Text": "{0}\nModel: N/A | Link: {1}\n{2}\n{3}"
					},
					"Translation": {
						"Text": "{0}\nModel: N/A | Link: {1}\n{2}\n{3}"
					},
					"Key": "Video.Feed"
				},
				{
					"Source": {
						"Text": "{0}\n{1} · {2}\n{3}\nWaypoint {4} / {5} · {6}"
					},
					"Translation": {
						"Text": "{0}\n{1} · {2}\n{3}\nWaypoint {4} / {5} · {6}"
					},
					"Key": "Execution.Summary"
				},
				{
					"Source": {
						"Text": "{0}   |   CMD {1}   MAP {2}   VID {3}"
					},
					"Translation": {
						"Text": "{0}   |   CMD {1}   MAP {2}   VID {3}"
					},
					"Key": "Stage1.Health"
				},
				{
					"Source": {
						"Text": "{0}  {1}"
					},
					"Translation": {
						"Text": "{0}  {1}"
					},
					"Key": "Workflow.Step"
				},
				{
					"Source": {
						"Text": "{0}  |  {1}"
					},
					"Translation": {
						"Text": "{0}  |  {1}"
					},
					"Key": "Stage1.Identity"
				},
				{
					"Source": {
						"Text": "{0}  ·  Tasks: {1}\nLast modified: {2}"
					},
					"Translation": {
						"Text": "{0}  ·  Tasks: {1}\nLast modified: {2}"
					},
					"Key": "Workflow.PlanCard"
				},
				{
					"Source": {
						"Text": "{0} / {1} UTC {2}"
					},
					"Translation": {
						"Text": "{0} / {1} UTC {2}"
					},
					"Key": "Alarm.Severity"
				},
				{
					"Source": {
						"Text": "{0} / {1}: predicted {2} m; required {3} m. Execution blocked."
					},
					"Translation": {
						"Text": "{0} / {1}: predicted {2} m; required {3} m. Execution blocked."
					},
					"Key": "Group.Conflict"
				},
				{
					"Source": {
						"Text": "{0} UAV | {1} ONLINE | {2} ALERTS"
					},
					"Translation": {
						"Text": "{0} UAV | {1} ONLINE | {2} ALERTS"
					},
					"Key": "Command.Count"
				},
				{
					"Source": {
						"Text": "{0} | Camera: N/A | Resolution: {1} | FPS: {2} | {3}"
					},
					"Translation": {
						"Text": "{0} | Camera: N/A | Resolution: {1} | FPS: {2} | {3}"
					},
					"Key": "Video.Details"
				},
				{
					"Source": {
						"Text": "{0} | UAV: {1} | Waypoints: {2}"
					},
					"Translation": {
						"Text": "{0} | UAV: {1} | Waypoints: {2}"
					},
					"Key": "Plan.MissionSummary"
				},
				{
					"Source": {
						"Text": "{0} | VIDEO TARGET: {1} | ACTIVE UAV: {2}"
					},
					"Translation": {
						"Text": "{0} | VIDEO TARGET: {1} | ACTIVE UAV: {2}"
					},
					"Key": "Video.Header"
				},
				{
					"Source": {
						"Text": "{0} — new version"
					},
					"Translation": {
						"Text": "{0} — new version"
					},
					"Key": "Workflow.VersionName"
				},
				{
					"Source": {
						"Text": "{source} client connected"
					},
					"Translation": {
						"Text": "{source} client connected"
					},
					"Key": "Events.client_connected"
				},
				{
					"Source": {
						"Text": "{source} client disconnected"
					},
					"Translation": {
						"Text": "{source} client disconnected"
					},
					"Key": "Events.client_disconnected"
				},
				{
					"Source": {
						"Text": "{uav_id} assigned to mission {mission_name}"
					},
					"Translation": {
						"Text": "{uav_id} assigned to mission {mission_name}"
					},
					"Key": "Events.UAV_ASSIGNED"
				},
				{
					"Source": {
						"Text": "{uav_id}: immediate start requested"
					},
					"Translation": {
						"Text": "{uav_id}: immediate start requested"
					},
					"Key": "Events.SCHEDULE_DUE"
				},
				{
					"Source": {
						"Text": "{uav_id}: motion paused by safety separation check"
					},
					"Translation": {
						"Text": "{uav_id}: motion paused by safety separation check"
					},
					"Key": "Events.SAFETY_CONFLICT"
				},
				{
					"Source": {
						"Text": "{uav_id}: scheduled mission cancelled"
					},
					"Translation": {
						"Text": "{uav_id}: scheduled mission cancelled"
					},
					"Key": "Events.MISSION_CANCELLED"
				},
				{
					"Source": {
						"Text": "{uav_id}: scheduled mission started"
					},
					"Translation": {
						"Text": "{uav_id}: scheduled mission started"
					},
					"Key": "Events.SCHEDULE_STARTED"
				},
				{
					"Source": {
						"Text": "{uav_id}: start time updated"
					},
					"Translation": {
						"Text": "{uav_id}: start time updated"
					},
					"Key": "Events.SCHEDULE_CHANGED"
				},
				{
					"Source": {
						"Text": "● ROUTE EDITING"
					},
					"Translation": {
						"Text": "● ROUTE EDITING"
					},
					"Key": "Workflow.RouteEditBanner"
				},
				{
					"Source": {
						"Text": "● {0}  {1}"
					},
					"Translation": {
						"Text": "● {0}  {1}"
					},
					"Key": "Workflow.ActiveStep"
				},
				{
					"Source": {
						"Text": "✓ Mock UAV configured"
					},
					"Translation": {
						"Text": "✓ Mock UAV configured"
					},
					"Key": "Execution.MockAvailable"
				},
				{
					"Source": {
						"Text": "✓ Security plan deployed"
					},
					"Translation": {
						"Text": "✓ Security plan deployed"
					},
					"Key": "Workflow.DeploymentSuccess"
				},
				{
					"Source": {
						"Text": "中文"
					},
					"Translation": {
						"Text": "中文"
					},
					"Key": "Workflow.Chinese"
				}
			]
		}
	]
}